using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace BlackMamba.Billing.Models.Billing
{
    public class CardPaymentDataDict
    {
        public static Dictionary<string, string> CardPaymentCallBackStatusDesc = new Dictionary<string, string>
        {
            {"-1", "第三方支付还未响应"},
            {"-2", "第三方支付请求异常"},
            {"0", "销卡成功，订单成功"},
            {"1", "销卡成功，订单失败"},
            {"7", "卡号卡密或卡面额不符合规则"},
            {"1002", "本张卡密您提交过于频繁，请您稍后再试"},
            {"1003", "不支持的卡类型（比如电信地方卡）"},
            {"1004", "密码错误或充值卡无效"},
            {"1006", "充值卡无效"},
            {"1007", "卡内余额不足"},
            {"1008", "余额卡过期（有效期1个月）"},
            {"1010", "此卡正在处理中"},
            {"10000", "未知错误"},
            {"2005", "此卡已使用"},
            {"2006", "卡密在系统处理中"},
            {"2007", "该卡为假卡"},
            {"2008", "该卡种正在维护"},
            {"2009", "浙江省移动维护"},
            {"2010", "江苏省移动维护"},
            {"2011", "福建省移动维护"},
            {"2012", "辽宁省移动维护"},
            {"2013", "该卡已被锁定"},
            {"2014", "系统繁忙，请稍后再试"},
            {"3001", "卡不存在"},
            {"3002", "卡已使用过"},
            {"3003", "卡已作废"},  
            {"3004", "卡已冻结"}, 
            {"3005", "卡未激活"},
            {"3006", "密码不正确"},
            {"3007", "卡正在处理中"},
            {"3101", "系统错误"},
            {"3102", "卡已过期"}
        };

        public static Dictionary<string, string> CardPaymentRequestStatusDesc = new Dictionary<string, string>
        {
            {"0", "还未向第三方支付发送请求"},
            {"-2", "请求第三方支付没有返回结果"},
            {"1", "成功"},
            {"-1", "签名较验失败或未知错误"},
            {"2", "卡密成功处理过或者提交卡号过于频繁"},
            {"5", "卡数量过多，目前最多支持10张卡"},
            {"11", "订单号重复"},
            {"66", "支付金额有误"},
            {"95", "支付方式未开通"},
            {"112", "业务状态不可用，未开通此类卡业务"},
            {"8001", "卡面额组填写错误"},
            {"8002", "卡号密码为空或者数量不相等（使用组合支付时）"}
        };   
    }
}
